Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Критерий используется для сравнения моделей с разным числом параметров, когда требуется выбрать наилучший набор объясняющих переменных
en: The criterion is used for comparison of the models with different number of parameters when it is required to select the best set of explicative variables.

source: Критерий основан на использовании функции правдоподобия и тесно связан с информационным критерием Акаике
en: The criterion is based on use of likelihood function, and it is closely connected with the Akaike information criterion

source: Критерий разделения определяется параметром "Вид групповой обработки":
en: The division criterion is governed by the "Type of group processing" parameter:

source: Кроме доступа к личной папке, администратором сервера пользователю могут быть предоставлены права на доступ к другим папкам файлового хранилища.
en: Apart from access to the personal folder, a user can be provided with access rights to other file storage folders by the server administrator.

source: Кроме них в контекстном меню доступны команды:
en: Besides, the following commands are also available in the context menu:

source: Кроме типа данных Строковый где не учитываются записи только со значением <null>.| | Количество пропусков|•|•|•|•|•|•|Показывает количество записей с пустыми значениями, со значением <null> или со значениями не соответствующими типу данных.
en: With the exception of String data type where only the records with <null> value are not taken into account.| | Null count|•|•|•|•|•|•|It displays the number of records with the null values, <null> value or the values that do not match the data type.

source: Кроме типа данных Строковый, где пропусками считаются записи со значением <null>.| | Первый|•|•|•|•|•|•|Выводит значение первой записи в наборе данных.| | Последний|&nbsp;&nbsp;•&nbsp;&nbsp;|&nbsp;&nbsp;•&nbsp;&nbsp;|&nbsp;&nbsp;•&nbsp;&nbsp;|&nbsp;&nbsp;•&nbsp;&nbsp;|&nbsp;&nbsp;•&nbsp;&nbsp;|&nbsp;&nbsp;•&nbsp;&nbsp;|Выводит значение последней записи наборе данных.|
en: With the exception of String data type where the records with <null> value are considered to be null.| | The first|•|•|•|•|•|•|It shows the value of the first record in the data set.| | The last|&nbsp;&nbsp;•&nbsp;&nbsp;|&nbsp;&nbsp;•&nbsp;&nbsp;|&nbsp;&nbsp;•&nbsp;&nbsp;|&nbsp;&nbsp;•&nbsp;&nbsp;|&nbsp;&nbsp;•&nbsp;&nbsp;|&nbsp;&nbsp;•&nbsp;&nbsp;|It shows the value of the last record in the data set.|

source: Кроме того, Loginom позволяет параллельно выполнять нескольких ветвей Сценария.
en: Besides, Loginom enables to execute several Workflow branches in parallel.

source: Кроме того, можно установить следующие признаки:
en: Besides, it is possible to set the following indicators:

source: Кроме этого, для каждого входного столбца может быть вычислен уровень значимости (отсутствует, очень низкая, низкая, средняя, высокая и очень высокая), на основе которого может производиться отбор переменных в модели бинарной классификации.
en: Besides, the significance level can be calculated for each input column (none, very low, low, mean, high and very high) according to which it is possible to select variables to the binary classification models.

source: Кросс-платформенное Хранилище данных является удобной базой для создания распределенных хранилищ данных, витрин данных и т.п.
en: The crossplatform Data Warehouse is the base convenient for creation of distributed data warehouses, datamarts, etc.

source: Кросс-таблица с колонкой: Товар Для колонки установлено минимальное количество уникальных значений = 4 Со строкой: Точка продажи Фактом: Сумма продажи (Сумма).
en: Cross table with the following column: Goods The minimum number of the unique values is set for the column = 4 With string: Point of sale Measure: Amount of sales (Amount).

source: Кубическая интерполяция
en: Cubic interpolation

source: Кубическая интерполяция — выявленные пропуски заменяются на промежуточные значения кубического сплайна (сплайны третьей степени с непрерывной первой производной), полученного по известным значениям;
en: Cubic interpolation: detected null data is replaced with the intermediate values of the cubic spline (the third degree splines with the continuous first derivative) received using the known values.

source: Кэширование выражений
en: Caching of Expressions

source: Кэширование данных требует дополнительный объем памяти, но в описанных выше случаях сокращает время выполнения алгоритма.
en: Data caching requires the additional memory size but in the cases described above it decreases the algorithm execution time.

source: Линейная интерполяция
en: Linear interpolation

source: Линейная интерполяция — выявленные пропуски заменяются на вычисленные промежуточные значения линейной функции, полученной по известным значениям (условно проведя прямую между ними);
en: Linear interpolation: detected null data is replaced with the calculated intermediate values of the linear function received using the known values (drawing a conditional line between them).

source: Линейная регрессия является одним из наиболее часто используемых алгоритмов в машинном обучении.
en: Linear regression is one of the most frequently used algorithms in machine learning.

source: Линейная.
en: Linear.

source: Личная папка пользователя имеет то же наименование, что и его учетная запись (логин).
en: The personal user folder and his account (login) have the same name.

source: Логарифмическая.
en: Logarithmic.

source: Логика выбора узлов:
en: Logics of Nodes Selection:

source: Логин и пароль выдаются администратором, но при установке программы существует пользователь по умолчанию — логин: user, без пароля.
en: Login and password are provided by the administrator, but there is a default user - login in the case of the software installation: user, without password.

source: Логин пользователя, открывший данный Сценарий
en: Login of the user who opened this Workflow

source: Логическая структура проектируется, прежде всего, с учетом задач предметной области.
en: First and foremost, the logical structure is designed taking into account the subject area objectives.

source: Логические значения:
en: Logical values:

source: Логические операции:
en: Logical operations:

source: Логический уровень
en: Logical Level

source: Лопата совковая
en: Square-point shovel

source: Любой
en: Any

source: Любой (валидный)
en: Any (valid)

source: Любую ячейку или диапазон ячеек Инспектора свойств можно выделить указателем мыши и скопировать ее (их) значение, нажав сочетание клавиш Ctrl+C.
en: It is possible to select with mouse cursor any cell or range of cells of the Property inspector by clicking and copy its (their) value by pressing Ctrl+C combination of keys.

source: Любые внесенные изменения немедленно отражаются на диаграмме и в таблице детализации.
en: Any introduced changes are immediately displayed in the chart and detailing table.

source: Макароны
en: Pasta

source: Максимальная длина строки 2 147 483 647 символов.
en: The maximum string length constitutes 2,147,483,647 characters.

source: Максимальная скорость.
en: Maximum speed.

source: Максимальная точность.
en: Maximum accuracy.

source: Максимальное количество классов.
en: Maximum class count.

source: Максимальное количество эпох - максимальное количество итераций обучения алгоритма.
en: Maximum number of epochs means the maximum count of the algorithm training iterations.

source: Максимальное количество эпох — максимальное количество итераций обучения алгоритма.
en: Maximum number of epochs: the maximum count of the algorithm training iterations.

source: Максимальное количество.
en: Maximum count.

source: Максимальное число кластеров.
en: The maximum number of clusters.

source: Максимальное.
en: Maximum.

source: Максимум факторов.
en: Maximum factors.

source: Максимум;
en: Maximum;

source: Малый вес класса указывает на его низкую значимость и целесообразность объединения с некоторым другим классом.
en: The low class weight denotes its low significance and necessity of union with another class.

source: Масло
en: Butter

source: Мастер настройки
en: Wizard

source: Мастер настройки включает в себя следующие группы параметров:
en: The wizard includes the following groups of parameters:

source: Мастер настройки вызова сервиса состоит из нескольких шагов.
en: The service call wizard consists of several steps.

source: Мастер настройки обработчика представляет собой отображение дерева (дерево, поданое на выход входного порта) с возможностью выбора некоторых или всех узлов.
en: The handler wizard is a tree view (the tree passed to output of the input port) with possibility to select some or all nodes.

source: Мастер настройки предлагает различные варианты обработки данной ситуации.
en: The wizard enables to use different processing options in this situation.

source: Мастер настройки содержит следующие параметры:
en: There are the following parameters in the wizard:

source: Мастер настройки состоит из двух основных областей: область настройки параметров квантования и область отображения результатов квантования.
en: The wizard consists of two main areas: area of binning parameters configuration and area of binning results display.

source: Мастер настройки состоит из следующих шагов:
en: The wizard includes the following steps:

source: Мастер настройки узла
en: Node Wizard

source: Мастер содержит несколько этапов настройки.
en: The wizard contains several configuration stages.

source: Матрицы ошибок
en: Confusion matrices

source: Медианная модификация.
en: Median modification.

source: Между списками доступно перемещение элементов, в том числе и с помощью перетаскивания (drag&drop).
en: It is possible to move items between the lists, including drag&drop (drag&drop).

source: Меньше факторов.
en: Less factors.

source: Меню
en: Menu

source: Меню действий содержит следующие команды:
en: The action menu contains the following commands:

source: Мера разброса данных наблюдений от смоделированных значений
en: Measure of spread of the observation data from the modeled values

source: Месяц
en: Month

source: Месяц - месяц в виде числа,
en: Month - month in the form of a number.

source: Метка
en: Caption

source: Метка интервала.
en: Bin caption.

source: Метка столбца.
en: Column caption.

source: Метка — выводятся подсказки, необходимые для понимания смысла того или иного элемента.
en: Caption: the tooltips necessary to understand the meaning of this or that element are displayed.

source: Метка, значение — одновременно выводятся и метки, и значения.
en: Caption, value: both captions, and values are displayed at the same time.

source: Метка, процент — одновременно выводятся и метки, и проценты.
en: Caption, percent: both captions, and percents are displayed at the same time.

source: Метка, процент, итог — одновременно отображаются метка, процентное соотношение и итог.
en: Caption, percent, total: caption, percentage and total are displayed at the same time.

source: Метки
en: Captions

source: Метки входных полей
en: Input fields captions

source: Метки полей.
en: Fields captions.

source: Метки столбцов (полей) - в качестве заголовков столбцов будут использованы Метки полей.
en: Captions of columns (fields): captions of fields will be used as headers of columns.

source: Метку — название, состоящее из любых символов; является пояснением для пользователя.
en: Caption: the name that consists of any characters. It is a clarification for a user.

source: Метку;
en: Caption

source: Метод валидации, который может принимать следующие значения:
en: Validation method that can take the following values:

source: Метод Монте-Карло
en: Monte Carlo method

source: Метод валидации
en: Validation Method

source: Метод возвращает булево значение true, если столбец в заданной строке имеет пропущенное значение.
en: The method returns the boolean true value if the column in the set string has the null value.

source: Метод возвращает значение заданного столбца в заданной строке.
en: The method returns the value of the set column in the set string.

source: Метод добавляет новую строку в выходной набор данных.
en: The method enables to append the new row to the output data set.

source: Метод задает значение заданного столбца в строке, добавленной методом Append().
en: The method enables to set the value of the set column in the string appended by the Append() method.

source: Метод контроля:
en: Control method:

source: Метод перекрестной проверки позволяет избежать этого.
en: The cross validation method enables to avoid it.

source: Метод получения окончательного решения
en: Method of receipt of the final decision

source: Метод разбиения
en: Partition Method

source: Метод разбиения на обучающее и тестовое множество.
en: Method of partition to training and test sets.

source: Метод формирования обучающего и тестового множеств для обучения аналитической модели в условиях недостаточности исходных данных или неравномерного представления классов.
en: The method used for selection of training and test sets for the analytical model training under conditions of insufficient source data or nonuniform display of classes.

source: Методом Drag-and-drop — перетащить метку поля из левого списка полей на элемент списка параметров запроса;
en: Drag-and-drop method: drag the field caption from the left list of the fields to the item of the request parameters list.

source: Методом Drag-and-drop — перетащить метку поля из левого списка полей на элемент схемы XML.
en: Drag-and-drop method: drag the field caption from the left list of the fields to the XML schema item.

source: Методы Console
en: Console Methods

source: Методы OutputTable
en: OutputTable Methods

source: Методы источника данных
en: Data Source Methods

source: Механизм повторного использования алгоритмов
en: Mechanism of the Algorithms Reuse

source: Механизм решения подзадачи внутри «черного ящика» можно изменить, но в целом проект при этом останется работоспособным и будет выполнять поставленные задачи.
en: It is possible to change the subtask solution mechanism inside the "black box". But on the whole, the project is still operable and wil perform the set tasks.

source: Механизм сокрытия портов
en: Mechanism of Ports Hidding

source: Механизмы интеграции предназначены для обмена данными между платформой Loginom и сторонними внешними системами.
en: The integration mechanisms are designated for data exchange between the third party external systems and Loginom platform.

source: Минимальное значение даты - 30.12.1899 00:00:00, максимальное - 31.12.9999 23:59:59.999 (точность 1 мc).
en: Minimum date value - 30.12.1899 00:00:00, maximum - 31.12.9999 23:59:59.999 (accuracy: 1 ms).

source: Минимальное значение равно 0.|
en: The minimum value is equal to 0.|

source: Минимальное количество экземпляров узла равно 0, и не настраивается.
en: The minimum number of the node instances is equal to 0, and it cannot be configured.

source: Минимальное число кластеров.
en: The minimum number of clusters.

source: Минимальное.
en: Minimum.

source: Минимальные
en: Minimum

source: Минимальный вес класса, %.
en: Minimum class weight, %.

source: Минимальный вес, %.
en: Minimum weight, %.

source: Минимум факторов.
en: Minimum factors.

source: Минимум;
en: Minimum;

source: Минуты - минуты в виде числа,
en: Minutes - minutes in the form of a number.

source: Многократное использование созданной логики обработки для различных данных.
en: Multiple use of the created processing logics for different data.

source: Многопользовательская работа
en: Multiuser operation

source: Многострочный комментарий — им считаются все символы, содержащиеся между /* (слеш-звездочка) и */ (звездочка-слеш).
en: The multi-line comment is represented by all characters included between /* (slash-asterisk) and */ (asterisk-slash).

source: Многострочным комментарием считаются все символы, содержащиеся между /* (слеш-звездочка) и */ (звездочка-слеш).
en: The multi-line comment is represented by all characters included between /* (slash-asterisk) and */ (asterisk-slash).

source: Множества
en: Sets

source: Множество
en: Set

source: Могут быть добавлены новые связи.
en: New links can be added.

source: Модели ARIMA применяются для решения задач, в которых требуется построить прогноз на основе имеющихся данных, то есть вычислить последующие значения ряда на основе предыдущих.
en: The ARIMA models are used to accomplish the tasks that require to make the forecast based on the available data, namely, to calculate subsequent series values according to the previous ones.

source: Модели функции
en: Function Models

source: Модель
en: Model

source: Модель строится на основе обучающего множества и проверяется на валидационном множестве.
en: The model is trainied on the training set basis, and it is checked using the validation set.

source: Модификатор доступа определяет доступность объекта на разных уровнях Пакета, а также между Пакетами.
en: The access modifier defines the object availability on different Package levels and between the Packages.

source: Модифицированный критерий Акаике, применяемый для выборок малого размера, когда отношение числа содержащихся в ней примеров к числу параметров модели меньше 40
en: The modified Akaike criterion used for the small samples when ratio of the number of the samples in it to the number of the model parameters is less than 40.

source: Модуль включает в себя:
en: The Module inludes the following items:

source: Модульная система ES6 (ECMAScript 6) не поддерживается.
en: ES6 module system (ECMAScript 6) is not supported.

source: Модульные системы
en: Module Systems

source: Может быть задан с помощью переменных.
en: It can be set by means of variables.

source: Может быть:
en: There are the following items:

source: Может принимать значения вещественного типа в диапазоне 0.0625, 1026598E+8 с шагом 0.1.
en: It can take the real values in the range of 0.0625, 1026598E+8 at 0.1 intervals.

source: Может принимать значения: отсутствует, очень низкая, низкая, средняя, высокая и очень высокая.
en: It can take the following values: none, very low, low, mean, high and very high.

source: Может принимать следующие значения:
en: It can take the following values:

source: Может содержать в себе иерархию вложенных подмоделей.
en: It can include hierarchy of nested supernodes.

source: Может состоять из:
en: It can consist of the following characters:

source: Можно задать формат файла:
en: It is possible to set the following file formats:

source: Можно использовать domain\user формат или UPN(user@domain.com), если LDAP сервер позволяет это делать.
en: It is permissible to use domain\user format or UPN(user@domain.com) if the LDAP server makes it possible to do so.

source: Можно не указывать наименование порта (например: /Parameter1=true, однако, если переменная с указанным таким образом именем присутствует в нескольких портах, то возникнет исключение.
en: It is allowed not to specify the port name (for example, /Parameter1=true. However, if the variable with the name specified in such a manner is in several ports, it is an exception to the rule.

source: Можно опустить имя функции измерения, в таком случае по умолчанию будет функция Value, т.е. Имя измерения = Имя измерения.Value.
en: It is possible to omit the dimension function name. In this case, the Value function will be used by default, namely, Dimension name = Dimension name.Value.

source: Можно указать от 1, но не менее количества уникальных значений измерений в столбцах куба, до 1000 включительно.
en: It is possible to specify from 1 but not less than the count of unique values of dimensions in the cube columns up to 1000 inclusively.

source: Можно указать от 1, но не менее количества уникальных значений измерений в строках куба, до 100 включительно.
en: It is possible to specify from 1 but not less than the count of unique values of dimensions in the cube rows up to 100 inclusively.

source: Молоко
en: Milk

source: Московская обл.
en: The Moscow Region

source: Мыло детское
en: Baby soap

source: На базе подмодели может быть создан Производный компонент.
en: The Derived Component can be created on the supernode base.

source: На выбор будет предложено поместить отчет в заранее созданную группу или создать новую группу.
en: It will be asked to choose to place the report to the pre-created group or create the new group.

source: На выходных портах обработчика формируются таблицы с ответами сервиса, возвращенными ошибками и дополнительными данными.
en: Tables with the service responses, returned errors and additional data is generated in the output ports of the handler.

source: На данной диаграмме оранжевым цветом изображен график, соответствующий исходному ряду данных (динамика цен на нефть марки Brent), а синим - исходный ряд, обработанный компонентом "Сглаживание" с помощью фильтра Ходрика-Прескотта с параметром LAMBDA, равным 100.
en: The chart that complies with the source data series (the Brent crude oil price movement) is shown in orange. The source data series processed with the "Smoothing" component using the Hodrick-Prescott filter with LAMBDA parameter equal to 100 is shown in blue.

source: На данной странице представлены основные действия с Пакетами.
en: The main operations with Packages are listed on this page.

source: На данной странице происходит работа с внутренними элементами объекта, выбранного на предыдущем шаге: измерениями, атрибутами и фактами.
en: This page is designated for work with internal items of the object selected at the previous stage: dimensions, attributes and facts.

source: На данном шаге выбираются атрибуты ошибок, которые необходимо вывести в выходном наборе порта Исключения.
en: Attributes of the errors that are to be displayed in the output data set of the Exceptions port are selected at this stage.

source: На данном шаге задаются имена заголовков HTTP-запроса и их значения.
en: HTTP request headers and their values are set at this stage.

source: На данном шаге задаются имена и значения заголовков HTTP-запросов к сервису.
en: Names and values of headers of HTTP requests to the service are set at this stage.

source: На данном шаге задаются параметры запроса.
en: The request parameters are set at this stage.

source: На данном этапе необходимо задать:
en: At this stage it is required to provide the following settings:

source: На данном этапе предоставляется список узлов текущего модуля.
en: A list of nodes of the current module is provided at this stage.

source: На данном этапе производится выбор полей для кластеризации:
en: The fields for clustering are selected at this stage:

source: На значение
en: With Value

source: На значение;
en: With value.

source: На итерации, при которой значение переменной удовлетворяет условию, работа цикла заканчивается.
en: The loop ends at the iteration that makes the variable value meet such condition.

source: На логическом уровне разрабатывается схема хранилища, т.е. устанавливается соответствие между объектами предметной области: процессами, измерениями и фактами хранилища:
en: At the logical level the data warehouse shema is developed, namely, mapping between subject area objects is established: processes, dimensions and measures of the data warehouse:

source: На обработку логических и строковых полей положение флага не влияет.
en: The checkbox status does not affect processing of logical and string fields.

source: На одной странице отображается 50 000 записей.
en: 50,000 records are displayed on one page.

source: На основе исходного столбца формируются остальные.
en: Other columns are generated on the basis of the source column.

source: На панели "Навигация" выбрать элемент Ссылки;
en: select Reference item on the "Navigation" panel;

source: На панели инструментов доступны следующие команды:
en: The following commands are available on the toolbar:
